user_tracking/app/controllers/requests_controller.rb

  def index
    @requests = Request.last(50).reverse
---
SELECT  "requests".* FROM "requests" ORDER BY "requests"."id" DESC LIMIT ?  [["LIMIT", 50]]