user_tracking/app/jobs/lead_job.rb

  def perform(*args)
    Lead.create!(args)
---
INSERT INTO "leads" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "teste"], ["email", "johnn_lds@hotmail.com"], ["created_at", "2019-05-05 22:28:30.415825"], ["updated_at", "2019-05-05 22:28:30.415825"]]