user_tracking/app/jobs/request_job.rb

  def perform(*args)
    Request.create!(args)
---
INSERT INTO "requests" ("uuid", "request_url", "new_lead", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)